# Задача 34
# Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм.
# Поскольку разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам стоит написать программу.
# Винни-Пух считает, что ритм есть, если число слогов (т.е. число гласных букв) в каждой фразе стихотворения одинаковое.
# Фраза может состоять из одного слова, если во фразе несколько слов, то они разделяются дефисами.
# Фразы отделяются друг от друга пробелами.
# Стихотворение Винни-Пух вбивает в программу с клавиатуры.
# В ответе напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не в порядке

# Пример:
# Ввод:
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам

def vini_vini(input_str):
    vowels = "ауоыиэяюёе"
    input_str = input_str.split()

    phr = dict(zip(input_str, [0]*len(input_str)))

    for key in phr: 
        for i in key:
            if i in vowels:
                phr[key] += 1

    values = list(phr.values())
    
    res = all(item == values[0] for item in values)
    if res == True:
        return 'Парам пам-пам'
    else:
        return 'Пам парам'

input_str = 'пара-ра-рам рам-пам-папам па-ра-па-дам'
print(vini_vini(input_str))